Autodesk.Revit.UI.UIApplication.ManagedCall
Subscribe to the ManagedCall event to be notified when Revit wants to show a modal dialog on GeneratedUiFrameWork.
Remarks:
This event is raised when Revit wants to show a modal dialog on GeneratedUiFrameWork.
Event is not cancellable. The 'Cancellable' property of event's argument is always False.
Since:
2027

Autodesk.Revit.UI.UIApplication.OptimizeAnnotationsEditModeExited
Subscribe to the OptimizeAnnotationsEditModeExited event to be notified after exiting isolate annotations edit mode.
Remarks:
This event is raised after exiting isolate annotations edit mode.
Since:
2027

Autodesk.Revit.UI.UIApplication.OptimizeAnnotationsEditModeEntered
Subscribe to the OptimizeAnnotationsEditModeEntered event to be notified after entering isolate annotations edit mode.
Remarks:
This event is raised after entering isolate annotations edit mode.
Since:
2027

Autodesk.Revit.UI.UIApplication.ShowScenarioConnectionIndicator(System.Boolean)
Shows scenario connection indicator.
visible:
True to set the indicator as visible.

Autodesk.Revit.UI.UIApplication.ActiveAddInId
Gets the AddInId of the currently active external application or external command.
Remarks:
If no add-in is currently active, this property returns the AddInId containing the GUID of the native Revit application - RevitApplicationId